valtlInf/xensiv-magnetic-sensors-sw-examples/Angle-Sensors/Motix/TLx49012/tlx49012_tle987x_integrationexample/RTE/Device/TLE9879QXA40/port.h
/*
 ***********************************************************************************************************************
 *
 * Copyright (c) Infineon Technologies AG
 * All rights reserved.
 *
 * The applicable license agreement can be found at this pack's installation directory in the file
 * license/IFX_SW_Licence_MOTIX_LITIX.txt
 *
 **********************************************************************************************************************/
/**
 * \file     port.h
 *
 * \brief    Port/GPIO low level access library
 *
 * \version  V0.6.1
 * \date     02. Jan 2025
 *
 * \note This file violates [MISRA Rule 38], [MISRA Rule 45]
 */

/*******************************************************************************
**                             Author(s) Identity                             **
********************************************************************************
** Initials     Name                                                          **
** ---------------------------------------------------------------------------**
** SS           Steffen Storandt                                              **
** DM           Daniel Mysliwitz                                              **
** TA           Thomas Albersinger                                            **
** JO           Julia Ott                                                     **
** BG           Blandine Guillot                                              **
*******************************************************************************/

/*******************************************************************************
**                          Revision Control History                          **
********************************************************************************
** V0.1.0: 2012-11-12, SS:   Initial version                                  **
** V0.2.0: 2012-12-13, SS:   New SFR format                                   **
** V0.3.0: 2013-02-10, DM:   Function Port_ChangePin() enhanced by Port Dir   **
**                           adjustment, ne function added PORT_ChangePinAlt  **
**                           to set the alternative settings for a Port Pin at**
**                           runtime                                          **
** V0.4.0: 2013-10-16, DM:   Port configuration changed into header file      **
**                           with Configuration Wizard                        **
**                           Configuration stored into #defines               **
**                           Port_Init() modified                             **
** V0.5.0: 2014-04-25, TA:   Port_Init(): use #defines from IFX Config Wizard **
** V0.5.1: 2015-02-10, DM:   Individual header file added                     **
** V0.5.2: 2017-02-16, DM:   Port prefix changed to capital letters           **
**                           API extended                                     **
** V0.5.3: 2017-10-10, DM:   MISRA 2012 compliance, the following PC-Lint     **
**                           rules are globally deactivated:                  **
**                           - Info 793: ANSI/ISO limit of 6 'significant     **
**                             characters in an external identifier           **
**                           - Info 835: A zero has been given as right       **
**                             argument to operator                           **
**                           - Info 845: The left argument to operator '&'    **
**                             is certain to be 0                             **
**                           The following MISRA rules are deactivated locally**
**                           - Warning 572: Excessive shift value (precision 0**
**                             shifted right by 1) [MISRA Rule 38]            **
** V0.5.4: 2018-03-20, DM:   Double slashes removed to meet MISRA 2012        **
**                           Replaced macros by INLINE functions              **
**                           Replaced register accesses within functions by   **
**                           function calls                                   **
**                           Replaced __STATIC_INLINE by INLINE               **
** V0.5.5: 2018-11-27, JO:   Doxygen update                                   **
**                           Moved revision history from port.c to port.h,    **
**                           Port_Init() uses new defines at PORT_XML_VERSION **
**                           >= 10303                                         **
**                           Replaced __STATIC_INLINE by INLINE               **
** V0.5.6: 2020-04-15, BG:   Updated revision history format                  **
** V0.5.7: 2020-07-21, BG:   EP-439: Formatted .h/.c files                    **
** V0.5.8: 2022-02-25, JO:   EP-1040: Corrected usage of CMSIS_Irq_Dis()      **
** V0.5.9: 2022-02-28, JO:   EP-936: Updated copyright and branding           **
** V0.6.0: 2022-03-17, JO:   EP-260: Added initialization of SCU->Px_POCONy   **
**                           to apply driver strength setting                 **
** V0.6.1: 2025-01-02, JO:   EP-1493: Updated license                         **
*******************************************************************************/

#ifndef PORT_H
#define PORT_H

/*******************************************************************************
**                                  Includes                                  **
*******************************************************************************/
#include "tle987x.h"
#include "types.h"
#include "cmsis_misra.h"
#include "sfr_access.h"

/*******************************************************************************
**                          Global Macro Definitions                          **
*******************************************************************************/

/**\brief Port indices, Port P0*/
#define PORT_P0 (0U)
/**\brief Port indices, Port P1*/
#define PORT_P1 (1U)
/**\brief Port indices, Port P2*/
#define PORT_P2 (2U)

/**\brief Port actions, clear*/
#define PORT_ACTION_CLEAR  (0U)
/**\brief Port actions, set*/
#define PORT_ACTION_SET    (1U)
/**\brief Port actions, toggle*/
#define PORT_ACTION_TOGGLE (2U)
/**\brief Port actions, input*/
#define PORT_ACTION_INPUT  (3U)
/**\brief Port actions, output*/
#define PORT_ACTION_OUTPUT (4U)

