valtlInf/xensiv-magnetic-sensors-sw-examples/Angle-Sensors/Motix/TLx49012/tlx49012_tle987x_integrationexample/RTE/Device/TLE9879QXA40/port.h
/** \brief sets Port P01 to High Status.
 *
 * \brief <b>Example</b><br>
 * \brief This example configures P01 as output, High and Open-Drain.
 * ~~~~~~~~~~~~~~~{.c}
 * void Example_Function(void)
 * {
 *     PORT_P01_Output_Set();
 *     PORT_P01_Output_High_Set();
 *     PORT_P01_OpenDrain_En();
 * }
 * ~~~~~~~~~~~~~~~
 * \ingroup PORT_api
 */
INLINE void PORT_P01_Output_High_Set(void)
{
  Field_Mod8(&PORT->P0_DATA.reg, (uint8)PORT_P0_DATA_P1_Pos, (uint8)PORT_P0_DATA_P1_Msk, 1u);
}

/** \brief sets Port P01 to Low Status.
 *
 * \brief <b>Example</b><br>
 * \brief This example configures P01 as output, Low and Open-Drain.
 * ~~~~~~~~~~~~~~~{.c}
 * void Example_Function(void)
 * {
 *     PORT_P01_Output_Set();
 *     PORT_P01_Output_Low_Set();
 *     PORT_P01_OpenDrain_En();
 * }
 * ~~~~~~~~~~~~~~~
 * \ingroup PORT_api
 */
INLINE void PORT_P01_Output_Low_Set(void)
{
  Field_Mod8(&PORT->P0_DATA.reg, (uint8)PORT_P0_DATA_P1_Pos, (uint8)PORT_P0_DATA_P1_Msk, 0u);
}

/** \brief sets Port P01 to Toggle Status.
 *
 * \brief <b>Example</b><br>
 * \brief This example configures P01 as output, Toggle and Open-Drain.
 * ~~~~~~~~~~~~~~~{.c}
 * void Example_Function(void)
 * {
 *     PORT_P01_Output_Set();
 *     PORT_P01_Output_Toggle_Set();
 *     PORT_P01_OpenDrain_En();
 * }
 * ~~~~~~~~~~~~~~~
 * \ingroup PORT_api
 */
INLINE void PORT_P01_Output_Toggle_Set(void)
{
  Field_Inv8(&PORT->P0_DATA.reg, (uint8)PORT_P0_DATA_P1_Msk);
}

/** \brief sets Port P02 to High Status.
 *
 * \brief <b>Example</b><br>
 * \brief This example configures P02 as output, High and Open-Drain.
 * ~~~~~~~~~~~~~~~{.c}
 * void Example_Function(void)
 * {
 *     PORT_P02_Output_Set();
 *     PORT_P02_Output_High_Set();
 *     PORT_P02_OpenDrain_En();
 * }
 * ~~~~~~~~~~~~~~~
 * \ingroup PORT_api
 */
INLINE void PORT_P02_Output_High_Set(void)
{
  Field_Mod8(&PORT->P0_DATA.reg, (uint8)PORT_P0_DATA_P2_Pos, (uint8)PORT_P0_DATA_P2_Msk, 1u);
}

/** \brief sets Port P02 to Low Status.
 *
 * \brief <b>Example</b><br>
 * \brief This example configures P02 as output, Low and Open-Drain.
 * ~~~~~~~~~~~~~~~{.c}
 * void Example_Function(void)
 * {
 *     PORT_P02_Output_Set();
 *     PORT_P02_Output_Low_Set();
 *     PORT_P02_OpenDrain_En();
 * }
 * ~~~~~~~~~~~~~~~
 * \ingroup PORT_api
 */
INLINE void PORT_P02_Output_Low_Set(void)
{
  Field_Mod8(&PORT->P0_DATA.reg, (uint8)PORT_P0_DATA_P2_Pos, (uint8)PORT_P0_DATA_P2_Msk, 0u);
}

/** \brief sets Port P02 to Toggle Status.
 *
 * \brief <b>Example</b><br>
 * \brief This example configures P02 as output, Toggle and Open-Drain.
 * ~~~~~~~~~~~~~~~{.c}
 * void Example_Function(void)
 * {
 *     PORT_P02_Output_Set();
 *     PORT_P02_Output_Toggle_Set();
 *     PORT_P02_OpenDrain_En();
 * }
 * ~~~~~~~~~~~~~~~
 * \ingroup PORT_api
 */
INLINE void PORT_P02_Output_Toggle_Set(void)
{
  Field_Inv8(&PORT->P0_DATA.reg, (uint8)PORT_P0_DATA_P2_Msk);
}

/** \brief sets Port P03 to High Status.
 *
 * \brief <b>Example</b><br>
 * \brief This example configures P03 as output, High and Open-Drain.
 * ~~~~~~~~~~~~~~~{.c}
 * void Example_Function(void)
 * {
 *     PORT_P03_Output_Set();
 *     PORT_P03_Output_High_Set();
 *     PORT_P03_OpenDrain_En();
 * }
 * ~~~~~~~~~~~~~~~
 * \ingroup PORT_api
 */
INLINE void PORT_P03_Output_High_Set(void)
{
  Field_Mod8(&PORT->P0_DATA.reg, (uint8)PORT_P0_DATA_P3_Pos, (uint8)PORT_P0_DATA_P3_Msk, 1u);
}

/** \brief sets Port P03 to Low Status.
 *
 * \brief <b>Example</b><br>
 * \brief This example configures P03 as output, Low and Open-Drain.
 * ~~~~~~~~~~~~~~~{.c}
 * void Example_Function(void)
 * {
 *     PORT_P03_Output_Set();
 *     PORT_P03_Output_Low_Set();
 *     PORT_P03_OpenDrain_En();
 * }
 * ~~~~~~~~~~~~~~~
 * \ingroup PORT_api
 */
INLINE void PORT_P03_Output_Low_Set(void)
{
  Field_Mod8(&PORT->P0_DATA.reg, (uint8)PORT_P0_DATA_P3_Pos, (uint8)PORT_P0_DATA_P3_Msk, 0u);
}

/** \brief sets Port P03 to Toggle Status.
 *
 * \brief <b>Example</b><br>
 * \brief This example configures P03 as output, Toggle and Open-Drain.
 * ~~~~~~~~~~~~~~~{.c}
 * void Example_Function(void)
 * {
 *     PORT_P03_Output_Set();
 *     PORT_P03_Output_Toggle_Set();
 *     PORT_P03_OpenDrain_En();
 * }
 * ~~~~~~~~~~~~~~~
 * \ingroup PORT_api
 */
INLINE void PORT_P03_Output_Toggle_Set(void)
{
  Field_Inv8(&PORT->P0_DATA.reg, (uint8)PORT_P0_DATA_P3_Msk);
}

/** \brief sets Port P04 to High Status.
 *
 * \brief <b>Example</b><br>
 * \brief This example configures P04 as output, High and Open-Drain.
 * ~~~~~~~~~~~~~~~{.c}
 * void Example_Function(void)
 * {
 *     PORT_P04_Output_Set();
 *     PORT_P04_Output_High_Set();
 *     PORT_P04_OpenDrain_En();
 * }
 * ~~~~~~~~~~~~~~~
 * \ingroup PORT_api
 */
INLINE void PORT_P04_Output_High_Set(void)
{
  Field_Mod8(&PORT->P0_DATA.reg, (uint8)PORT_P0_DATA_P4_Pos, (uint8)PORT_P0_DATA_P4_Msk, 1u);
}

/** \brief sets Port P04 to Low Status.
 *
 * \brief <b>Example</b><br>
 * \brief This example configures P04 as output, Low and Open-Drain.
 * ~~~~~~~~~~~~~~~{.c}
 * void Example_Function(void)
 * {
 *     PORT_P04_Output_Set();
 *     PORT_P04_Output_Low_Set();
 *     PORT_P04_OpenDrain_En();
 * }
 * ~~~~~~~~~~~~~~~
 * \ingroup PORT_api
 */
INLINE void PORT_P04_Output_Low_Set(void)
{
  Field_Mod8(&PORT->P0_DATA.reg, (uint8)PORT_P0_DATA_P4_Pos, (uint8)PORT_P0_DATA_P4_Msk, 0u);
}

/** \brief sets Port P04 to Toggle Status.
 *
 * \brief <b>Example</b><br>
 * \brief This example configures P04 as output, Toggle and Open-Drain.
 * ~~~~~~~~~~~~~~~{.c}
 * void Example_Function(void)
 * {
 *     PORT_P04_Output_Set();
 *     PORT_P04_Output_Toggle_Set();
 *     PORT_P04_OpenDrain_En();
 * }
 * ~~~~~~~~~~~~~~~
 * \ingroup PORT_api
 */
INLINE void PORT_P04_Output_Toggle_Set(void)
{
  Field_Inv8(&PORT->P0_DATA.reg, (uint8)PORT_P0_DATA_P4_Msk);
}

/** \brief reads Port P00 Status.
 *
 * \return P00 Status
 *
 * \brief <b>Example</b><br>
 * \brief This example configures P00 as input and reads the status.
 * ~~~~~~~~~~~~~~~{.c}
 * void Example_Function(void)
 * {
 *     uint8 sts;
 *
 *     PORT_P00_Input_Set();
 *     sts = PORT_P00_Get();
 * }
 * ~~~~~~~~~~~~~~~
 * \ingroup PORT_api
 */
INLINE uint8 PORT_P00_Get(void)
{
  return ( u8_Field_Rd8(&PORT->P0_DATA.reg, (uint8)PORT_P0_DATA_P0_Pos, (uint8)PORT_P0_DATA_P0_Msk) );
}

