valtlInf/xensiv-magnetic-sensors-sw-examples/Angle-Sensors/Motix/TLx49012/tlx49012_tle987x_integrationexample/RTE/Device/TLE9879QXA40/port.h
/** \brief enables PullUpDown for Port P02.
 *
 * \brief <b>Example</b><br>
 * \brief This example enables PullUpDown for Port P02.
 * ~~~~~~~~~~~~~~~{.c}
 * void Example_Function(void)
 * {
 *     PORT_P02_PullUpDown_En();
 * }
 * ~~~~~~~~~~~~~~~
 * \ingroup PORT_api
 */
INLINE void PORT_P02_PullUpDown_En(void)
{
  Field_Mod8(&PORT->P0_PUDEN.reg, (uint8)PORT_P0_PUDEN_P2_Pos, (uint8)PORT_P0_PUDEN_P2_Msk, 1u);
}

/** \brief disables PullUpDown for Port P02.
 *
 * \brief <b>Example</b><br>
 * \brief This example disables PullUpDown for Port P02.
 * ~~~~~~~~~~~~~~~{.c}
 * void Example_Function(void)
 * {
 *     PORT_P02_PullUpDown_Dis();
 * }
 * ~~~~~~~~~~~~~~~
 * \ingroup PORT_api
 */
INLINE void PORT_P02_PullUpDown_Dis(void)
{
  Field_Mod8(&PORT->P0_PUDEN.reg, (uint8)PORT_P0_PUDEN_P2_Pos, (uint8)PORT_P0_PUDEN_P2_Msk, 0u);
}

/** \brief enables PullUpDown for Port P03.
 *
 * \brief <b>Example</b><br>
 * \brief This example enables PullUpDown for Port P03.
 * ~~~~~~~~~~~~~~~{.c}
 * void Example_Function(void)
 * {
 *     PORT_P03_PullUpDown_En();
 * }
 * ~~~~~~~~~~~~~~~
 * \ingroup PORT_api
 */
INLINE void PORT_P03_PullUpDown_En(void)
{
  Field_Mod8(&PORT->P0_PUDEN.reg, (uint8)PORT_P0_PUDEN_P3_Pos, (uint8)PORT_P0_PUDEN_P3_Msk, 1u);
}

/** \brief disables PullUpDown for Port P03.
 *
 * \brief <b>Example</b><br>
 * \brief This example disables PullUpDown for Port P03.
 * ~~~~~~~~~~~~~~~{.c}
 * void Example_Function(void)
 * {
 *     PORT_P03_PullUpDown_Dis();
 * }
 * ~~~~~~~~~~~~~~~
 * \ingroup PORT_api
 */
INLINE void PORT_P03_PullUpDown_Dis(void)
{
  Field_Mod8(&PORT->P0_PUDEN.reg, (uint8)PORT_P0_PUDEN_P3_Pos, (uint8)PORT_P0_PUDEN_P3_Msk, 0u);
}

/** \brief enables PullUpDown for Port P04.
 *
 * \brief <b>Example</b><br>
 * \brief This example enables PullUpDown for Port P04.
 * ~~~~~~~~~~~~~~~{.c}
 * void Example_Function(void)
 * {
 *     PORT_P04_PullUpDown_En();
 * }
 * ~~~~~~~~~~~~~~~
 * \ingroup PORT_api
 */
INLINE void PORT_P04_PullUpDown_En(void)
{
  Field_Mod8(&PORT->P0_PUDEN.reg, (uint8)PORT_P0_PUDEN_P4_Pos, (uint8)PORT_P0_PUDEN_P4_Msk, 1u);
}

/** \brief disables PullUpDown for Port P04.
 *
 * \brief <b>Example</b><br>
 * \brief This example disables PullUpDown for Port P04.
 * ~~~~~~~~~~~~~~~{.c}
 * void Example_Function(void)
 * {
 *     PORT_P04_PullUpDown_Dis();
 * }
 * ~~~~~~~~~~~~~~~
 * \ingroup PORT_api
 */
INLINE void PORT_P04_PullUpDown_Dis(void)
{
  Field_Mod8(&PORT->P0_PUDEN.reg, (uint8)PORT_P0_PUDEN_P4_Pos, (uint8)PORT_P0_PUDEN_P4_Msk, 0u);
}

/** \brief sets PullUp for Port P00.
 *
 * \brief <b>Example</b><br>
 * \brief This example sets PullUp for Port P00.
 * ~~~~~~~~~~~~~~~{.c}
 * void Example_Function(void)
 * {
 *     PORT_P00_PullUpDown_En();
 *     PORT_P00_PullUp_Set();
 * }
 * ~~~~~~~~~~~~~~~
 * \ingroup PORT_api
 */
INLINE void PORT_P00_PullUp_Set(void)
{
  Field_Mod8(&PORT->P0_PUDSEL.reg, (uint8)PORT_P0_PUDSEL_P0_Pos, (uint8)PORT_P0_PUDSEL_P0_Msk, 1u);
}

/** \brief sets PullDown for Port P00.
 *
 * \brief <b>Example</b><br>
 * \brief This example sets PullDown for Port P00.
 * ~~~~~~~~~~~~~~~{.c}
 * void Example_Function(void)
 * {
 *     PORT_P00_PullUpDown_En();
 *     PORT_P00_PullDown_Set();
 * }
 * ~~~~~~~~~~~~~~~
 * \ingroup PORT_api
 */
INLINE void PORT_P00_PullDown_Set(void)
{
  Field_Mod8(&PORT->P0_PUDSEL.reg, (uint8)PORT_P0_PUDSEL_P0_Pos, (uint8)PORT_P0_PUDSEL_P0_Msk, 0u);
}

/** \brief sets PullUp for Port P01.
 *
 * \brief <b>Example</b><br>
 * \brief This example sets PullUp for Port P01.
 * ~~~~~~~~~~~~~~~{.c}
 * void Example_Function(void)
 * {
 *     PORT_P01_PullUpDown_En();
 *     PORT_P01_PullUp_Set();
 * }
 * ~~~~~~~~~~~~~~~
 * \ingroup PORT_api
 */
INLINE void PORT_P01_PullUp_Set(void)
{
  Field_Mod8(&PORT->P0_PUDSEL.reg, (uint8)PORT_P0_PUDSEL_P1_Pos, (uint8)PORT_P0_PUDSEL_P1_Msk, 1u);
}

/** \brief sets PullDown for Port P01.
 *
 * \brief <b>Example</b><br>
 * \brief This example sets PullDown for Port P01.
 * ~~~~~~~~~~~~~~~{.c}
 * void Example_Function(void)
 * {
 *     PORT_P01_PullUpDown_En();
 *     PORT_P01_PullDown_Set();
 * }
 * ~~~~~~~~~~~~~~~
 * \ingroup PORT_api
 */
INLINE void PORT_P01_PullDown_Set(void)
{
  Field_Mod8(&PORT->P0_PUDSEL.reg, (uint8)PORT_P0_PUDSEL_P1_Pos, (uint8)PORT_P0_PUDSEL_P1_Msk, 0u);
}

/** \brief sets PullUp for Port P02.
 *
 * \brief <b>Example</b><br>
 * \brief This example sets PullUp for Port P02.
 * ~~~~~~~~~~~~~~~{.c}
 * void Example_Function(void)
 * {
 *     PORT_P02_PullUpDown_En();
 *     PORT_P02_PullUp_Set();
 * }
 * ~~~~~~~~~~~~~~~
 * \ingroup PORT_api
 */
INLINE void PORT_P02_PullUp_Set(void)
{
  Field_Mod8(&PORT->P0_PUDSEL.reg, (uint8)PORT_P0_PUDSEL_P2_Pos, (uint8)PORT_P0_PUDSEL_P2_Msk, 1u);
}

/** \brief sets PullDown for Port P02.
 *
 * \brief <b>Example</b><br>
 * \brief This example sets PullDown for Port P02.
 * ~~~~~~~~~~~~~~~{.c}
 * void Example_Function(void)
 * {
 *     PORT_P02_PullUpDown_En();
 *     PORT_P02_PullDown_Set();
 * }
 * ~~~~~~~~~~~~~~~
 * \ingroup PORT_api
 */
INLINE void PORT_P02_PullDown_Set(void)
{
  Field_Mod8(&PORT->P0_PUDSEL.reg, (uint8)PORT_P0_PUDSEL_P2_Pos, (uint8)PORT_P0_PUDSEL_P2_Msk, 0u);
}

/** \brief sets PullUp for Port P03.
 *
 * \brief <b>Example</b><br>
 * \brief This example sets PullUp for Port P03.
 * ~~~~~~~~~~~~~~~{.c}
 * void Example_Function(void)
 * {
 *     PORT_P03_PullUpDown_En();
 *     PORT_P03_PullUp_Set();
 * }
 * ~~~~~~~~~~~~~~~
 * \ingroup PORT_api
 */
INLINE void PORT_P03_PullUp_Set(void)
{
  Field_Mod8(&PORT->P0_PUDSEL.reg, (uint8)PORT_P0_PUDSEL_P3_Pos, (uint8)PORT_P0_PUDSEL_P3_Msk, 1u);
}

/** \brief sets PullDown for Port P03.
 *
 * \brief <b>Example</b><br>
 * \brief This example sets PullDown for Port P03.
 * ~~~~~~~~~~~~~~~{.c}
 * void Example_Function(void)
 * {
 *     PORT_P03_PullUpDown_En();
 *     PORT_P03_PullDown_Set();
 * }
 * ~~~~~~~~~~~~~~~
 * \ingroup PORT_api
 */
INLINE void PORT_P03_PullDown_Set(void)
{
  Field_Mod8(&PORT->P0_PUDSEL.reg, (uint8)PORT_P0_PUDSEL_P3_Pos, (uint8)PORT_P0_PUDSEL_P3_Msk, 0u);
}

/** \brief sets PullUp for Port P04.
 *
 * \brief <b>Example</b><br>
 * \brief This example sets PullUp for Port P04.
 * ~~~~~~~~~~~~~~~{.c}
 * void Example_Function(void)
 * {
 *     PORT_P04_PullUpDown_En();
 *     PORT_P04_PullUp_Set();
 * }
 * ~~~~~~~~~~~~~~~
 * \ingroup PORT_api
 */
INLINE void PORT_P04_PullUp_Set(void)
{
  Field_Mod8(&PORT->P0_PUDSEL.reg, (uint8)PORT_P0_PUDSEL_P4_Pos, (uint8)PORT_P0_PUDSEL_P4_Msk, 1u);
}

/** \brief sets PullDown for Port P04.
 *
 * \brief <b>Example</b><br>
 * \brief This example sets PullDown for Port P04.
 * ~~~~~~~~~~~~~~~{.c}
 * void Example_Function(void)
 * {
 *     PORT_P04_PullUpDown_En();
 *     PORT_P04_PullDown_Set();
 * }
 * ~~~~~~~~~~~~~~~
 * \ingroup PORT_api
 */
INLINE void PORT_P04_PullDown_Set(void)
{
  Field_Mod8(&PORT->P0_PUDSEL.reg, (uint8)PORT_P0_PUDSEL_P4_Pos, (uint8)PORT_P0_PUDSEL_P4_Msk, 0u);
}

/** \brief sets Port P10 to Output.
 *
 * \brief <b>Example</b><br>
 * \brief This example configures P10 as output, High and Open-Drain.
 * ~~~~~~~~~~~~~~~{.c}
 * void Example_Function(void)
 * {
 *     PORT_P10_Output_Set();
 *     PORT_P10_Output_High_Set();
 *     PORT_P10_OpenDrain_En();
 * }
 * ~~~~~~~~~~~~~~~
 * \ingroup PORT_api
 */
INLINE void PORT_P10_Output_Set(void)
{
  Field_Mod8(&PORT->P1_DIR.reg, (uint8)PORT_P1_DIR_P0_Pos, (uint8)PORT_P1_DIR_P0_Msk, 1u);
}

