valtlInf/xensiv-magnetic-sensors-sw-examples/Angle-Sensors/Motix/TLx49012/tlx49012_tle987x_integrationexample/RTE/Device/TLE9879QXA40/port.h
/** \brief sets Port P11 to Low Status.
 *
 * \brief <b>Example</b><br>
 * \brief This example configures P11 as output, Low and Open-Drain.
 * ~~~~~~~~~~~~~~~{.c}
 * void Example_Function(void)
 * {
 *     PORT_P11_Output_Set();
 *     PORT_P11_Output_Low_Set();
 *     PORT_P11_OpenDrain_En();
 * }
 * ~~~~~~~~~~~~~~~
 * \ingroup PORT_api
 */
INLINE void PORT_P11_Output_Low_Set(void)
{
  Field_Mod8(&PORT->P1_DATA.reg, (uint8)PORT_P1_DATA_P1_Pos, (uint8)PORT_P1_DATA_P1_Msk, 0u);
}

/** \brief sets Port P11 to Toggle Status.
 *
 * \brief <b>Example</b><br>
 * \brief This example configures P11 as output, Toggle and Open-Drain.
 * ~~~~~~~~~~~~~~~{.c}
 * void Example_Function(void)
 * {
 *     PORT_P11_Output_Set();
 *     PORT_P11_Output_Toggle_Set();
 *     PORT_P11_OpenDrain_En();
 * }
 * ~~~~~~~~~~~~~~~
 * \ingroup PORT_api
 */
INLINE void PORT_P11_Output_Toggle_Set(void)
{
  Field_Inv8(&PORT->P1_DATA.reg, (uint8)PORT_P1_DATA_P1_Msk);
}

/** \brief sets Port P12 to High Status.
 *
 * \brief <b>Example</b><br>
 * \brief This example configures P12 as output, High and Open-Drain.
 * ~~~~~~~~~~~~~~~{.c}
 * void Example_Function(void)
 * {
 *     PORT_P12_Output_Set();
 *     PORT_P12_Output_High_Set();
 *     PORT_P12_P13_OpenDrain_En();
 * }
 * ~~~~~~~~~~~~~~~
 * \ingroup PORT_api
 */
INLINE void PORT_P12_Output_High_Set(void)
{
  Field_Mod8(&PORT->P1_DATA.reg, (uint8)PORT_P1_DATA_P2_Pos, (uint8)PORT_P1_DATA_P2_Msk, 1u);
}

/** \brief sets Port P12 to Low Status.
 *
 * \brief <b>Example</b><br>
 * \brief This example configures P12 as output, Low and Open-Drain.
 * ~~~~~~~~~~~~~~~{.c}
 * void Example_Function(void)
 * {
 *     PORT_P12_Output_Set();
 *     PORT_P12_Output_Low_Set();
 *     PORT_P12_P13_OpenDrain_En();
 * }
 * ~~~~~~~~~~~~~~~
 * \ingroup PORT_api
 */
INLINE void PORT_P12_Output_Low_Set(void)
{
  Field_Mod8(&PORT->P1_DATA.reg, (uint8)PORT_P1_DATA_P2_Pos, (uint8)PORT_P1_DATA_P2_Msk, 0u);
}

/** \brief sets Port P12 to Toggle Status.
 *
 * \brief <b>Example</b><br>
 * \brief This example configures P12 as output, Toggle and Open-Drain.
 * ~~~~~~~~~~~~~~~{.c}
 * void Example_Function(void)
 * {
 *     PORT_P12_Output_Set();
 *     PORT_P12_Output_Toggle_Set();
 *     PORT_P12_P13_OpenDrain_En();
 * }
 * ~~~~~~~~~~~~~~~
 * \ingroup PORT_api
 */
INLINE void PORT_P12_Output_Toggle_Set(void)
{
  Field_Inv8(&PORT->P1_DATA.reg, (uint8)PORT_P1_DATA_P2_Msk);
}

/** \brief sets Port P13 to High Status.
 *
 * \brief <b>Example</b><br>
 * \brief This example configures P13 as output, High and Open-Drain.
 * ~~~~~~~~~~~~~~~{.c}
 * void Example_Function(void)
 * {
 *     PORT_P13_Output_Set();
 *     PORT_P13_Output_High_Set();
 *     PORT_P12_P13_OpenDrain_En();
 * }
 * ~~~~~~~~~~~~~~~
 * \ingroup PORT_api
 */
INLINE void PORT_P13_Output_High_Set(void)
{
  Field_Mod8(&PORT->P1_DATA.reg, (uint8)PORT_P1_DATA_P3_Pos, (uint8)PORT_P1_DATA_P3_Msk, 1u);
}

/** \brief sets Port P13 to Low Status.
 *
 * \brief <b>Example</b><br>
 * \brief This example configures P13 as output, Low and Open-Drain.
 * ~~~~~~~~~~~~~~~{.c}
 * void Example_Function(void)
 * {
 *     PORT_P13_Output_Set();
 *     PORT_P13_Output_Low_Set();
 *     PORT_P12_P13_OpenDrain_En();
 * }
 * ~~~~~~~~~~~~~~~
 * \ingroup PORT_api
 */
INLINE void PORT_P13_Output_Low_Set(void)
{
  Field_Mod8(&PORT->P1_DATA.reg, (uint8)PORT_P1_DATA_P3_Pos, (uint8)PORT_P1_DATA_P3_Msk, 0u);
}

/** \brief sets Port P13 to Toggle Status.
 *
 * \brief <b>Example</b><br>
 * \brief This example configures P13 as output, Toggle and Open-Drain.
 * ~~~~~~~~~~~~~~~{.c}
 * void Example_Function(void)
 * {
 *     PORT_P13_Output_Set();
 *     PORT_P13_Output_Toggle_Set();
 *     PORT_P12_P13_OpenDrain_En();
 * }
 * ~~~~~~~~~~~~~~~
 * \ingroup PORT_api
 */
INLINE void PORT_P13_Output_Toggle_Set(void)
{
  Field_Inv8(&PORT->P1_DATA.reg, (uint8)PORT_P1_DATA_P3_Msk);
}

/** \brief sets Port P14 to High Status.
 *
 * \brief <b>Example</b><br>
 * \brief This example configures P14 as output, High and Open-Drain.
 * ~~~~~~~~~~~~~~~{.c}
 * void Example_Function(void)
 * {
 *     PORT_P14_Output_Set();
 *     PORT_P14_Output_High_Set();
 *     PORT_P14_OpenDrain_En();
 * }
 * ~~~~~~~~~~~~~~~
 * \ingroup PORT_api
 */
INLINE void PORT_P14_Output_High_Set(void)
{
  Field_Mod8(&PORT->P1_DATA.reg, (uint8)PORT_P1_DATA_P4_Pos, (uint8)PORT_P1_DATA_P4_Msk, 1u);
}

/** \brief sets Port P14 to Low Status.
 *
 * \brief <b>Example</b><br>
 * \brief This example configures P14 as output, Low and Open-Drain.
 * ~~~~~~~~~~~~~~~{.c}
 * void Example_Function(void)
 * {
 *     PORT_P14_Output_Set();
 *     PORT_P14_Output_Low_Set();
 *     PORT_P14_OpenDrain_En();
 * }
 * ~~~~~~~~~~~~~~~
 * \ingroup PORT_api
 */
INLINE void PORT_P14_Output_Low_Set(void)
{
  Field_Mod8(&PORT->P1_DATA.reg, (uint8)PORT_P1_DATA_P4_Pos, (uint8)PORT_P1_DATA_P4_Msk, 0u);
}

/** \brief sets Port P14 to Toggle Status.
 *
 * \brief <b>Example</b><br>
 * \brief This example configures P14 as output, Toggle and Open-Drain.
 * ~~~~~~~~~~~~~~~{.c}
 * void Example_Function(void)
 * {
 *     PORT_P14_Output_Set();
 *     PORT_P14_Output_Toggle_Set();
 *     PORT_P14_OpenDrain_En();
 * }
 * ~~~~~~~~~~~~~~~
 * \ingroup PORT_api
 */
INLINE void PORT_P14_Output_Toggle_Set(void)
{
  Field_Inv8(&PORT->P1_DATA.reg, (uint8)PORT_P1_DATA_P4_Msk);
}

/** \brief reads Port P10 Status.
 *
 * \return P10 Status
 *
 * \brief <b>Example</b><br>
 * \brief This example configures P10 as input and reads the status.
 * ~~~~~~~~~~~~~~~{.c}
 * void Example_Function(void)
 * {
 *     uint8 sts;
 *
 *     PORT_P10_Input_Set();
 *     sts = PORT_P10_Get();
 * }
 * ~~~~~~~~~~~~~~~
 * \ingroup PORT_api
 */
INLINE uint8 PORT_P10_Get(void)
{
  return ( u8_Field_Rd8(&PORT->P1_DATA.reg, (uint8)PORT_P1_DATA_P0_Pos, (uint8)PORT_P1_DATA_P0_Msk) );
}

/** \brief reads Port P11 Status.
 *
 * \return P11 Status
 *
 * \brief <b>Example</b><br>
 * \brief This example configures P11 as input and reads the status.
 * ~~~~~~~~~~~~~~~{.c}
 * void Example_Function(void)
 * {
 *     uint8 sts;
 *
 *     PORT_P11_Input_Set();
 *     sts = PORT_P11_Get();
 * }
 * ~~~~~~~~~~~~~~~
 * \ingroup PORT_api
 */
INLINE uint8 PORT_P11_Get(void)
{
  return ( u8_Field_Rd8(&PORT->P1_DATA.reg, (uint8)PORT_P1_DATA_P1_Pos, (uint8)PORT_P1_DATA_P1_Msk) );
}

/** \brief reads Port P12 Status.
 *
 * \brief <b>Example</b><br>
 * \brief This example configures P12 as input and reads the status.
 * ~~~~~~~~~~~~~~~{.c}
 * void Example_Function(void)
 * {
 *     uint8 sts;
 *
 *     PORT_P12_Input_Set();
 *     sts = PORT_P12_Get();
 * }
 * ~~~~~~~~~~~~~~~
 * \ingroup PORT_api
 */
INLINE uint8 PORT_P12_Get(void)
{
  return ( u8_Field_Rd8(&PORT->P1_DATA.reg, (uint8)PORT_P1_DATA_P2_Pos, (uint8)PORT_P1_DATA_P2_Msk) );
}

