valtlInf/xensiv-magnetic-sensors-sw-examples/Angle-Sensors/Motix/TLx49012/tlx49012_tle987x_integrationexample/RTE/Device/TLE9879QXA40/port.h
/** \brief reads Port P13 Status.
 *
 * \brief <b>Example</b><br>
 * \brief This example configures P13 as input and reads the status.
 * ~~~~~~~~~~~~~~~{.c}
 * void Example_Function(void)
 * {
 *     uint8 sts;
 *
 *     PORT_P13_Input_Set();
 *     sts = PORT_P13_Get();
 * }
 * ~~~~~~~~~~~~~~~
 * \ingroup PORT_api
 */
INLINE uint8 PORT_P13_Get(void)
{
  return ( u8_Field_Rd8(&PORT->P1_DATA.reg, (uint8)PORT_P1_DATA_P3_Pos, (uint8)PORT_P1_DATA_P3_Msk) );
}

/** \brief reads Port P14 Status.
 *
 * \brief <b>Example</b><br>
 * \brief This example configures P14 as input and reads the status.
 * ~~~~~~~~~~~~~~~{.c}
 * void Example_Function(void)
 * {
 *     uint8 sts;
 *
 *     PORT_P14_Input_Set();
 *     sts = PORT_P14_Get();
 * }
 * ~~~~~~~~~~~~~~~
 * \ingroup PORT_api
 */
INLINE uint8 PORT_P14_Get(void)
{
  return ( u8_Field_Rd8(&PORT->P1_DATA.reg, (uint8)PORT_P1_DATA_P4_Pos, (uint8)PORT_P1_DATA_P4_Msk) );
}

/** \brief enables Output OpenDrain for Port P10.
 *
 * \brief <b>Example</b><br>
 * \brief This example configures P10 as output, Low and Open-Drain.
 * ~~~~~~~~~~~~~~~{.c}
 * void Example_Function(void)
 * {
 *     PORT_P10_Output_Set();
 *     PORT_P10_Output_Low_Set();
 *     PORT_P10_OpenDrain_En();
 * }
 * ~~~~~~~~~~~~~~~
 * \ingroup PORT_api
 */
INLINE void PORT_P10_OpenDrain_En(void)
{
  Field_Mod8(&PORT->P1_OD.reg, (uint8)PORT_P1_OD_P0_Pos, (uint8)PORT_P1_OD_P0_Msk, 1u);
}

/** \brief disables Output OpenDrain for Port P10.
 *
 * \brief <b>Example</b><br>
 * \brief This example configures P10 as output, Low and Normal Mode.
 * ~~~~~~~~~~~~~~~{.c}
 * void Example_Function(void)
 * {
 *     PORT_P10_Output_Set();
 *     PORT_P10_Output_Low_Set();
 *     PORT_P10_OpenDrain_Dis();
 * }
 * ~~~~~~~~~~~~~~~
 * \ingroup PORT_api
 */
INLINE void PORT_P10_OpenDrain_Dis(void)
{
  Field_Mod8(&PORT->P1_OD.reg, (uint8)PORT_P1_OD_P0_Pos, (uint8)PORT_P1_OD_P0_Msk, 0u);
}

/** \brief enables Output OpenDrain for Port P11.
 *
 * \brief <b>Example</b><br>
 * \brief This example configures P11 as output, Low and Open-Drain.
 * ~~~~~~~~~~~~~~~{.c}
 * void Example_Function(void)
 * {
 *     PORT_P11_Output_Set();
 *     PORT_P11_Output_Low_Set();
 *     PORT_P11_OpenDrain_En();
 * }
 * ~~~~~~~~~~~~~~~
 * \ingroup PORT_api
 */
INLINE void PORT_P11_OpenDrain_En(void)
{
  Field_Mod8(&PORT->P1_OD.reg, (uint8)PORT_P1_OD_P1_Pos, (uint8)PORT_P1_OD_P1_Msk, 1u);
}

/** \brief disables Output OpenDrain for Port P11.
 *
 * \brief <b>Example</b><br>
 * \brief This example configures P11 as output, Low and Normal Mode.
 * ~~~~~~~~~~~~~~~{.c}
 * void Example_Function(void)
 * {
 *     PORT_P11_Output_Set();
 *     PORT_P11_Output_Low_Set();
 *     PORT_P11_OpenDrain_Dis();
 * }
 * ~~~~~~~~~~~~~~~
 * \ingroup PORT_api
 */
INLINE void PORT_P11_OpenDrain_Dis(void)
{
  Field_Mod8(&PORT->P1_OD.reg, (uint8)PORT_P1_OD_P1_Pos, (uint8)PORT_P1_OD_P1_Msk, 0u);
}

/** \brief enables Output OpenDrain for Port P12/P13.
 *
 * \brief <b>Example</b><br>
 * \brief This example configures P12 as output, Low and Open-Drain.
 * ~~~~~~~~~~~~~~~{.c}
 * void Example_Function(void)
 * {
 *     PORT_P12_Output_Set();
 *     PORT_P12_Output_Low_Set();
 *     PORT_P12_P13_OpenDrain_En();
 * }
 * ~~~~~~~~~~~~~~~
 * \ingroup PORT_api
 */
INLINE void PORT_P12_P13_OpenDrain_En(void)
{
  Field_Mod8(&PORT->P1_OD.reg, (uint8)PORT_P1_OD_P3_P2_Pos, (uint8)PORT_P1_OD_P3_P2_Msk, 1u);
}

/** \brief disables Output OpenDrain for Port P12/P13.
 *
 * \brief <b>Example</b><br>
 * \brief This example configures P13 as output, Low and Normal Mode.
 * ~~~~~~~~~~~~~~~{.c}
 * void Example_Function(void)
 * {
 *     PORT_P13_Output_Set();
 *     PORT_P13_Output_Low_Set();
 *     PORT_P12_P13_OpenDrain_Dis();
 * }
 * ~~~~~~~~~~~~~~~
 * \ingroup PORT_api
 */
INLINE void PORT_P12_P13_OpenDrain_Dis(void)
{
  Field_Mod8(&PORT->P1_OD.reg, (uint8)PORT_P1_OD_P3_P2_Pos, (uint8)PORT_P1_OD_P3_P2_Msk, 0u);
}

/** \brief enables Output OpenDrain for Port P14.
 *
 * \brief <b>Example</b><br>
 * \brief This example configures P14 as output, Low and Open-Drain.
 * ~~~~~~~~~~~~~~~{.c}
 * void Example_Function(void)
 * {
 *     PORT_P14_Output_Set();
 *     PORT_P14_Output_Low_Set();
 *     PORT_P14_OpenDrain_En();
 * }
 * ~~~~~~~~~~~~~~~
 * \ingroup PORT_api
 */
INLINE void PORT_P14_OpenDrain_En(void)
{
  Field_Mod8(&PORT->P1_OD.reg, (uint8)PORT_P1_OD_P4_Pos, (uint8)PORT_P1_OD_P4_Msk, 1u);
}

/** \brief disables Output OpenDrain for Port P14.
 *
 * \brief <b>Example</b><br>
 * \brief This example configures P14 as output, Low and Normal Mode.
 * ~~~~~~~~~~~~~~~{.c}
 * void Example_Function(void)
 * {
 *     PORT_P14_Output_Set();
 *     PORT_P14_Output_Low_Set();
 *     PORT_P14_OpenDrain_Dis();
 * }
 * ~~~~~~~~~~~~~~~
 * \ingroup PORT_api
 */
INLINE void PORT_P14_OpenDrain_Dis(void)
{
  Field_Mod8(&PORT->P1_OD.reg, (uint8)PORT_P1_OD_P4_Pos, (uint8)PORT_P1_OD_P4_Msk, 0u);
}

/** \brief enables PullUpDown for Port P10.
 *
 * \brief <b>Example</b><br>
 * \brief This example enables PullUpDown for Port P10.
 * ~~~~~~~~~~~~~~~{.c}
 * void Example_Function(void)
 * {
 *     PORT_P10_PullUpDown_En();
 * }
 * ~~~~~~~~~~~~~~~
 * \ingroup PORT_api
 */
INLINE void PORT_P10_PullUpDown_En(void)
{
  Field_Mod8(&PORT->P1_PUDEN.reg, (uint8)PORT_P1_PUDEN_P0_Pos, (uint8)PORT_P1_PUDEN_P0_Msk, 1u);
}

/** \brief disables PullUpDown for Port P10.
 *
 * \brief <b>Example</b><br>
 * \brief This example disables PullUpDown for Port P10.
 * ~~~~~~~~~~~~~~~{.c}
 * void Example_Function(void)
 * {
 *     PORT_P10_PullUpDown_Dis();
 * }
 * ~~~~~~~~~~~~~~~
 * \ingroup PORT_api
 */
INLINE void PORT_P10_PullUpDown_Dis(void)
{
  Field_Mod8(&PORT->P1_PUDEN.reg, (uint8)PORT_P1_PUDEN_P0_Pos, (uint8)PORT_P1_PUDEN_P0_Msk, 0u);
}

/** \brief enables PullUpDown for Port P11.
 *
 * \brief <b>Example</b><br>
 * \brief This example enables PullUpDown for Port P11.
 * ~~~~~~~~~~~~~~~{.c}
 * void Example_Function(void)
 * {
 *     PORT_P11_PullUpDown_En();
 * }
 * ~~~~~~~~~~~~~~~
 * \ingroup PORT_api
 */
INLINE void PORT_P11_PullUpDown_En(void)
{
  Field_Mod8(&PORT->P1_PUDEN.reg, (uint8)PORT_P1_PUDEN_P1_Pos, (uint8)PORT_P1_PUDEN_P1_Msk, 1u);
}

