valtlInf/xensiv-magnetic-sensors-sw-examples/Angle-Sensors/Motix/TLx49012/tlx49012_tle987x_integrationexample/RTE/Device/TLE9879QXA40/port.h
/** \brief disables PullUpDown for Port P11.
 *
 * \brief <b>Example</b><br>
 * \brief This example disables PullUpDown for Port P11.
 * ~~~~~~~~~~~~~~~{.c}
 * void Example_Function(void)
 * {
 *     PORT_P11_PullUpDown_Dis();
 * }
 * ~~~~~~~~~~~~~~~
 * \ingroup PORT_api
 */
INLINE void PORT_P11_PullUpDown_Dis(void)
{
  Field_Mod8(&PORT->P1_PUDEN.reg, (uint8)PORT_P1_PUDEN_P1_Pos, (uint8)PORT_P1_PUDEN_P1_Msk, 0u);
}

/** \brief enables PullUpDown for Port P12.
 *
 * \brief <b>Example</b><br>
 * \brief This example enables PullUpDown for Port P12.
 * ~~~~~~~~~~~~~~~{.c}
 * void Example_Function(void)
 * {
 *     PORT_P12_PullUpDown_En();
 * }
 * ~~~~~~~~~~~~~~~
 * \ingroup PORT_api
 */
INLINE void PORT_P12_PullUpDown_En(void)
{
  Field_Mod8(&PORT->P1_PUDEN.reg, (uint8)PORT_P1_PUDEN_P2_Pos, (uint8)PORT_P1_PUDEN_P2_Msk, 1u);
}

/** \brief disables PullUpDown for Port P12.
 *
 * \brief <b>Example</b><br>
 * \brief This example disables PullUpDown for Port P12.
 * ~~~~~~~~~~~~~~~{.c}
 * void Example_Function(void)
 * {
 *     PORT_P12_PullUpDown_Dis();
 * }
 * ~~~~~~~~~~~~~~~
 * \ingroup PORT_api
 */
INLINE void PORT_P12_PullUpDown_Dis(void)
{
  Field_Mod8(&PORT->P1_PUDEN.reg, (uint8)PORT_P1_PUDEN_P2_Pos, (uint8)PORT_P1_PUDEN_P2_Msk, 0u);
}

/** \brief enables PullUpDown for Port P13.
 *
 * \brief <b>Example</b><br>
 * \brief This example enables PullUpDown for Port P13.
 * ~~~~~~~~~~~~~~~{.c}
 * void Example_Function(void)
 * {
 *     PORT_P13_PullUpDown_En();
 * }
 * ~~~~~~~~~~~~~~~
 * \ingroup PORT_api
 */
INLINE void PORT_P13_PullUpDown_En(void)
{
  Field_Mod8(&PORT->P1_PUDEN.reg, (uint8)PORT_P1_PUDEN_P3_Pos, (uint8)PORT_P1_PUDEN_P3_Msk, 1u);
}

/** \brief disables PullUpDown for Port P13.
 *
 * \brief <b>Example</b><br>
 * \brief This example disables PullUpDown for Port P13.
 * ~~~~~~~~~~~~~~~{.c}
 * void Example_Function(void)
 * {
 *     PORT_P13_PullUpDown_Dis();
 * }
 * ~~~~~~~~~~~~~~~
 * \ingroup PORT_api
 */
INLINE void PORT_P13_PullUpDown_Dis(void)
{
  Field_Mod8(&PORT->P1_PUDEN.reg, (uint8)PORT_P1_PUDEN_P3_Pos, (uint8)PORT_P1_PUDEN_P3_Msk, 0u);
}

/** \brief enables PullUpDown for Port P14.
 *
 * \brief <b>Example</b><br>
 * \brief This example enables PullUpDown for Port P14.
 * ~~~~~~~~~~~~~~~{.c}
 * void Example_Function(void)
 * {
 *     PORT_P14_PullUpDown_En();
 * }
 * ~~~~~~~~~~~~~~~
 * \ingroup PORT_api
 */
INLINE void PORT_P14_PullUpDown_En(void)
{
  Field_Mod8(&PORT->P1_PUDEN.reg, (uint8)PORT_P1_PUDEN_P4_Pos, (uint8)PORT_P1_PUDEN_P4_Msk, 1u);
}

/** \brief disables PullUpDown for Port P14.
 *
 * \brief <b>Example</b><br>
 * \brief This example disables PullUpDown for Port P14.
 * ~~~~~~~~~~~~~~~{.c}
 * void Example_Function(void)
 * {
 *     PORT_P14_PullUpDown_Dis();
 * }
 * ~~~~~~~~~~~~~~~
 * \ingroup PORT_api
 */
INLINE void PORT_P14_PullUpDown_Dis(void)
{
  Field_Mod8(&PORT->P1_PUDEN.reg, (uint8)PORT_P1_PUDEN_P4_Pos, (uint8)PORT_P1_PUDEN_P4_Msk, 0u);
}

/** \brief sets PullUp for Port P10.
 *
 * \brief <b>Example</b><br>
 * \brief This example sets PullUp for Port P10.
 * ~~~~~~~~~~~~~~~{.c}
 * void Example_Function(void)
 * {
 *     PORT_P10_PullUpDown_En();
 *     PORT_P10_PullUp_Set();
 * }
 * ~~~~~~~~~~~~~~~
 * \ingroup PORT_api
 */
INLINE void PORT_P10_PullUp_Set(void)
{
  Field_Mod8(&PORT->P1_PUDSEL.reg, (uint8)PORT_P1_PUDSEL_P0_Pos, (uint8)PORT_P1_PUDSEL_P0_Msk, 1u);
}

/** \brief sets PullDown for Port P10.
 *
 * \brief <b>Example</b><br>
 * \brief This example sets PullDown for Port P10.
 * ~~~~~~~~~~~~~~~{.c}
 * void Example_Function(void)
 * {
 *     PORT_P10_PullUpDown_En();
 *     PORT_P10_PullDown_Set();
 * }
 * ~~~~~~~~~~~~~~~
 * \ingroup PORT_api
 */
INLINE void PORT_P10_PullDown_Set(void)
{
  Field_Mod8(&PORT->P1_PUDSEL.reg, (uint8)PORT_P1_PUDSEL_P0_Pos, (uint8)PORT_P1_PUDSEL_P0_Msk, 0u);
}

/** \brief sets PullUp for Port P11.
 *
 * \brief <b>Example</b><br>
 * \brief This example sets PullUp for Port P11.
 * ~~~~~~~~~~~~~~~{.c}
 * void Example_Function(void)
 * {
 *     PORT_P11_PullUpDown_En();
 *     PORT_P11_PullUp_Set();
 * }
 * ~~~~~~~~~~~~~~~
 * \ingroup PORT_api
 */
INLINE void PORT_P11_PullUp_Set(void)
{
  Field_Mod8(&PORT->P1_PUDSEL.reg, (uint8)PORT_P1_PUDSEL_P1_Pos, (uint8)PORT_P1_PUDSEL_P1_Msk, 1u);
}

/** \brief sets PullDown for Port P11.
 *
 * \brief <b>Example</b><br>
 * \brief This example sets PullDown for Port P11.
 * ~~~~~~~~~~~~~~~{.c}
 * void Example_Function(void)
 * {
 *     PORT_P11_PullUpDown_En();
 *     PORT_P11_PullDown_Set();
 * }
 * ~~~~~~~~~~~~~~~
 * \ingroup PORT_api
 */
INLINE void PORT_P11_PullDown_Set(void)
{
  Field_Mod8(&PORT->P1_PUDSEL.reg, (uint8)PORT_P1_PUDSEL_P1_Pos, (uint8)PORT_P1_PUDSEL_P1_Msk, 0u);
}

/** \brief sets PullUp for Port P12.
 *
 * \brief <b>Example</b><br>
 * \brief This example sets PullUp for Port P12.
 * ~~~~~~~~~~~~~~~{.c}
 * void Example_Function(void)
 * {
 *     PORT_P12_PullUpDown_En();
 *     PORT_P12_PullUp_Set();
 * }
 * ~~~~~~~~~~~~~~~
 * \ingroup PORT_api
 */
INLINE void PORT_P12_PullUp_Set(void)
{
  Field_Mod8(&PORT->P1_PUDSEL.reg, (uint8)PORT_P1_PUDSEL_P2_Pos, (uint8)PORT_P1_PUDSEL_P2_Msk, 1u);
}

/** \brief sets PullDown for Port P12.
 *
 * \brief <b>Example</b><br>
 * \brief This example sets PullDown for Port P12.
 * ~~~~~~~~~~~~~~~{.c}
 * void Example_Function(void)
 * {
 *     PORT_P12_PullUpDown_En();
 *     PORT_P12_PullDown_Set();
 * }
 * ~~~~~~~~~~~~~~~
 * \ingroup PORT_api
 */
INLINE void PORT_P12_PullDown_Set(void)
{
  Field_Mod8(&PORT->P1_PUDSEL.reg, (uint8)PORT_P1_PUDSEL_P2_Pos, (uint8)PORT_P1_PUDSEL_P2_Msk, 0u);
}

/** \brief sets PullUp for Port P13.
 *
 * \brief <b>Example</b><br>
 * \brief This example sets PullUp for Port P13.
 * ~~~~~~~~~~~~~~~{.c}
 * void Example_Function(void)
 * {
 *     PORT_P13_PullUpDown_En();
 *     PORT_P13_PullUp_Set();
 * }
 * ~~~~~~~~~~~~~~~
 * \ingroup PORT_api
 */
INLINE void PORT_P13_PullUp_Set(void)
{
  Field_Mod8(&PORT->P1_PUDSEL.reg, (uint8)PORT_P1_PUDSEL_P3_Pos, (uint8)PORT_P1_PUDSEL_P3_Msk, 1u);
}

/** \brief sets PullDown for Port P13.
 *
 * \brief <b>Example</b><br>
 * \brief This example sets PullDown for Port P13.
 * ~~~~~~~~~~~~~~~{.c}
 * void Example_Function(void)
 * {
 *     PORT_P13_PullUpDown_En();
 *     PORT_P13_PullDown_Set();
 * }
 * ~~~~~~~~~~~~~~~
 * \ingroup PORT_api
 */
INLINE void PORT_P13_PullDown_Set(void)
{
  Field_Mod8(&PORT->P1_PUDSEL.reg, (uint8)PORT_P1_PUDSEL_P3_Pos, (uint8)PORT_P1_PUDSEL_P3_Msk, 0u);
}

