valtlInf/xensiv-magnetic-sensors-sw-examples/Angle-Sensors/Motix/TLx49012/tlx49012_tle987x_integrationexample/RTE/Device/TLE9879QXA40/port.h
/** \brief enables PullUpDown for Port P20.
 *
 * \brief <b>Example</b><br>
 * \brief This example enables PullUpDown for Port P20.
 * ~~~~~~~~~~~~~~~{.c}
 * void Example_Function(void)
 * {
 *     PORT_P20_PullUpDown_En();
 * }
 * ~~~~~~~~~~~~~~~
 * \ingroup PORT_api
 */
INLINE void PORT_P20_PullUpDown_En(void)
{
  Field_Mod8(&PORT->P2_PUDEN.reg, (uint8)PORT_P2_PUDEN_P0_Pos, (uint8)PORT_P2_PUDEN_P0_Msk, 1u);
}

/** \brief disables PullUpDown for Port P20.
 *
 * \brief <b>Example</b><br>
 * \brief This example disables PullUpDown for Port P20.
 * ~~~~~~~~~~~~~~~{.c}
 * void Example_Function(void)
 * {
 *     PORT_P20_PullUpDown_Dis();
 * }
 * ~~~~~~~~~~~~~~~
 * \ingroup PORT_api
 */
INLINE void PORT_P20_PullUpDown_Dis(void)
{
  Field_Mod8(&PORT->P2_PUDEN.reg, (uint8)PORT_P2_PUDEN_P0_Pos, (uint8)PORT_P2_PUDEN_P0_Msk, 0u);
}

/** \brief enables PullUpDown for Port P22.
 *
 * \brief <b>Example</b><br>
 * \brief This example enables PullUpDown for Port P22.
 * ~~~~~~~~~~~~~~~{.c}
 * void Example_Function(void)
 * {
 *     PORT_P22_PullUpDown_En();
 * }
 * ~~~~~~~~~~~~~~~
 * \ingroup PORT_api
 */
INLINE void PORT_P22_PullUpDown_En(void)
{
  Field_Mod8(&PORT->P2_PUDEN.reg, (uint8)PORT_P2_PUDEN_P2_Pos, (uint8)PORT_P2_PUDEN_P2_Msk, 1u);
}

/** \brief disables PullUpDown for Port P22.
 *
 * \brief <b>Example</b><br>
 * \brief This example disables PullUpDown for Port P22.
 * ~~~~~~~~~~~~~~~{.c}
 * void Example_Function(void)
 * {
 *     PORT_P22_PullUpDown_Dis();
 * }
 * ~~~~~~~~~~~~~~~
 * \ingroup PORT_api
 */
INLINE void PORT_P22_PullUpDown_Dis(void)
{
  Field_Mod8(&PORT->P2_PUDEN.reg, (uint8)PORT_P2_PUDEN_P2_Pos, (uint8)PORT_P2_PUDEN_P2_Msk, 0u);
}

/** \brief enables PullUpDown for Port P23.
 *
 * \brief <b>Example</b><br>
 * \brief This example enables PullUpDown for Port P23.
 * ~~~~~~~~~~~~~~~{.c}
 * void Example_Function(void)
 * {
 *     PORT_P23_PullUpDown_En();
 * }
 * ~~~~~~~~~~~~~~~
 * \ingroup PORT_api
 */
INLINE void PORT_P23_PullUpDown_En(void)
{
  Field_Mod8(&PORT->P2_PUDEN.reg, (uint8)PORT_P2_PUDEN_P3_Pos, (uint8)PORT_P2_PUDEN_P3_Msk, 1u);
}

/** \brief disables PullUpDown for Port P23.
 *
 * \brief <b>Example</b><br>
 * \brief This example disables PullUpDown for Port P23.
 * ~~~~~~~~~~~~~~~{.c}
 * void Example_Function(void)
 * {
 *     PORT_P23_PullUpDown_Dis();
 * }
 * ~~~~~~~~~~~~~~~
 * \ingroup PORT_api
 */
INLINE void PORT_P23_PullUpDown_Dis(void)
{
  Field_Mod8(&PORT->P2_PUDEN.reg, (uint8)PORT_P2_PUDEN_P3_Pos, (uint8)PORT_P2_PUDEN_P3_Msk, 0u);
}

/** \brief enables PullUpDown for Port P24.
 *
 * \brief <b>Example</b><br>
 * \brief This example enables PullUpDown for Port P24.
 * ~~~~~~~~~~~~~~~{.c}
 * void Example_Function(void)
 * {
 *     PORT_P24_PullUpDown_En();
 * }
 * ~~~~~~~~~~~~~~~
 * \ingroup PORT_api
 */
INLINE void PORT_P24_PullUpDown_En(void)
{
  Field_Mod8(&PORT->P2_PUDEN.reg, (uint8)PORT_P2_PUDEN_P4_Pos, (uint8)PORT_P2_PUDEN_P4_Msk, 1u);
}

/** \brief disables PullUpDown for Port P24.
 *
 * \brief <b>Example</b><br>
 * \brief This example disables PullUpDown for Port P24.
 * ~~~~~~~~~~~~~~~{.c}
 * void Example_Function(void)
 * {
 *     PORT_P24_PullUpDown_Dis();
 * }
 * ~~~~~~~~~~~~~~~
 * \ingroup PORT_api
 */
INLINE void PORT_P24_PullUpDown_Dis(void)
{
  Field_Mod8(&PORT->P2_PUDEN.reg, (uint8)PORT_P2_PUDEN_P4_Pos, (uint8)PORT_P2_PUDEN_P4_Msk, 0u);
}

/** \brief enables PullUpDown for Port P25.
 *
 * \brief <b>Example</b><br>
 * \brief This example enables PullUpDown for Port P25.
 * ~~~~~~~~~~~~~~~{.c}
 * void Example_Function(void)
 * {
 *     PORT_P25_PullUpDown_En();
 * }
 * ~~~~~~~~~~~~~~~
 * \ingroup PORT_api
 */
INLINE void PORT_P25_PullUpDown_En(void)
{
  Field_Mod8(&PORT->P2_PUDEN.reg, (uint8)PORT_P2_PUDEN_P5_Pos, (uint8)PORT_P2_PUDEN_P5_Msk, 1u);
}

/** \brief disables PullUpDown for Port P25.
 *
 * \brief <b>Example</b><br>
 * \brief This example disables PullUpDown for Port P25.
 * ~~~~~~~~~~~~~~~{.c}
 * void Example_Function(void)
 * {
 *     PORT_P25_PullUpDown_Dis();
 * }
 * ~~~~~~~~~~~~~~~
 * \ingroup PORT_api
 */
INLINE void PORT_P25_PullUpDown_Dis(void)
{
  Field_Mod8(&PORT->P2_PUDEN.reg, (uint8)PORT_P2_PUDEN_P5_Pos, (uint8)PORT_P2_PUDEN_P5_Msk, 0u);
}

/** \brief sets PullUp for Port P20.
 *
 * \brief <b>Example</b><br>
 * \brief This example sets PullUp for Port P20.
 * ~~~~~~~~~~~~~~~{.c}
 * void Example_Function(void)
 * {
 *     PORT_P20_PullUpDown_En();
 *     PORT_P20_PullUp_Set();
 * }
 * ~~~~~~~~~~~~~~~
 * \ingroup PORT_api
 */
INLINE void PORT_P20_PullUp_Set(void)
{
  Field_Mod8(&PORT->P2_PUDSEL.reg, (uint8)PORT_P2_PUDSEL_P0_Pos, (uint8)PORT_P2_PUDSEL_P0_Msk, 1u);
}

/** \brief sets PullDown for Port P20.
 *
 * \brief <b>Example</b><br>
 * \brief This example sets PullDown for Port P20.
 * ~~~~~~~~~~~~~~~{.c}
 * void Example_Function(void)
 * {
 *     PORT_P20_PullUpDown_En();
 *     PORT_P20_PullDown_Set();
 * }
 * ~~~~~~~~~~~~~~~
 * \ingroup PORT_api
 */
INLINE void PORT_P20_PullDown_Set(void)
{
  Field_Mod8(&PORT->P2_PUDSEL.reg, (uint8)PORT_P2_PUDSEL_P0_Pos, (uint8)PORT_P2_PUDSEL_P0_Msk, 0u);
}

/** \brief sets PullUp for Port P22.
 *
 * \brief <b>Example</b><br>
 * \brief This example sets PullUp for Port P22.
 * ~~~~~~~~~~~~~~~{.c}
 * void Example_Function(void)
 * {
 *     PORT_P22_PullUpDown_En();
 *     PORT_P22_PullUp_Set();
 * }
 * ~~~~~~~~~~~~~~~
 * \ingroup PORT_api
 */
INLINE void PORT_P22_PullUp_Set(void)
{
  Field_Mod8(&PORT->P2_PUDSEL.reg, (uint8)PORT_P2_PUDSEL_P2_Pos, (uint8)PORT_P2_PUDSEL_P2_Msk, 1u);
}

/** \brief sets PullDown for Port P22.
 *
 * \brief <b>Example</b><br>
 * \brief This example sets PullDown for Port P22.
 * ~~~~~~~~~~~~~~~{.c}
 * void Example_Function(void)
 * {
 *     PORT_P22_PullUpDown_En();
 *     PORT_P22_PullDown_Set();
 * }
 * ~~~~~~~~~~~~~~~
 * \ingroup PORT_api
 */
INLINE void PORT_P22_PullDown_Set(void)
{
  Field_Mod8(&PORT->P2_PUDSEL.reg, (uint8)PORT_P2_PUDSEL_P2_Pos, (uint8)PORT_P2_PUDSEL_P2_Msk, 0u);
}

/** \brief sets PullUp for Port P23.
 *
 * \brief <b>Example</b><br>
 * \brief This example sets PullUp for Port P23.
 * ~~~~~~~~~~~~~~~{.c}
 * void Example_Function(void)
 * {
 *     PORT_P23_PullUpDown_En();
 *     PORT_P23_PullUp_Set();
 * }
 * ~~~~~~~~~~~~~~~
 * \ingroup PORT_api
 */
INLINE void PORT_P23_PullUp_Set(void)
{
  Field_Mod8(&PORT->P2_PUDSEL.reg, (uint8)PORT_P2_PUDSEL_P3_Pos, (uint8)PORT_P2_PUDSEL_P3_Msk, 1u);
}

/** \brief sets PullDown for Port P23.
 *
 * \brief <b>Example</b><br>
 * \brief This example sets PullDown for Port P23.
 * ~~~~~~~~~~~~~~~{.c}
 * void Example_Function(void)
 * {
 *     PORT_P23_PullUpDown_En();
 *     PORT_P23_PullDown_Set();
 * }
 * ~~~~~~~~~~~~~~~
 * \ingroup PORT_api
 */
INLINE void PORT_P23_PullDown_Set(void)
{
  Field_Mod8(&PORT->P2_PUDSEL.reg, (uint8)PORT_P2_PUDSEL_P3_Pos, (uint8)PORT_P2_PUDSEL_P3_Msk, 0u);
}

/** \brief sets PullUp for Port P24.
 *
 * \brief <b>Example</b><br>
 * \brief This example sets PullUp for Port P24.
 * ~~~~~~~~~~~~~~~{.c}
 * void Example_Function(void)
 * {
 *     PORT_P24_PullUpDown_En();
 *     PORT_P24_PullUp_Set();
 * }
 * ~~~~~~~~~~~~~~~
 * \ingroup PORT_api
 */
INLINE void PORT_P24_PullUp_Set(void)
{
  Field_Mod8(&PORT->P2_PUDSEL.reg, (uint8)PORT_P2_PUDSEL_P4_Pos, (uint8)PORT_P2_PUDSEL_P4_Msk, 1u);
}

