valtlInf/xensiv-magnetic-sensors-sw-examples/Angle-Sensors/Motix/TLx49012/tlx49012_tle987x_integrationexample/RTE/Device/TLE9879QXA40/port.h
/** \brief sets PullDown for Port P24.
 *
 * \brief <b>Example</b><br>
 * \brief This example sets PullDown for Port P24.
 * ~~~~~~~~~~~~~~~{.c}
 * void Example_Function(void)
 * {
 *     PORT_P24_PullUpDown_En();
 *     PORT_P24_PullDown_Set();
 * }
 * ~~~~~~~~~~~~~~~
 * \ingroup PORT_api
 */
INLINE void PORT_P24_PullDown_Set(void)
{
  Field_Mod8(&PORT->P2_PUDSEL.reg, (uint8)PORT_P2_PUDSEL_P4_Pos, (uint8)PORT_P2_PUDSEL_P4_Msk, 0u);
}

/** \brief sets PullUp for Port P25.
 *
 * \brief <b>Example</b><br>
 * \brief This example sets PullUp for Port P25.
 * ~~~~~~~~~~~~~~~{.c}
 * void Example_Function(void)
 * {
 *     PORT_P25_PullUpDown_En();
 *     PORT_P25_PullUp_Set();
 * }
 * ~~~~~~~~~~~~~~~
 * \ingroup PORT_api
 */
INLINE void PORT_P25_PullUp_Set(void)
{
  Field_Mod8(&PORT->P2_PUDSEL.reg, (uint8)PORT_P2_PUDSEL_P5_Pos, (uint8)PORT_P2_PUDSEL_P5_Msk, 1u);
}

/** \brief sets PullDown for Port P25.
 *
 * \brief <b>Example</b><br>
 * \brief This example sets PullDown for Port P25.
 * ~~~~~~~~~~~~~~~{.c}
 * void Example_Function(void)
 * {
 *     PORT_P25_PullUpDown_En();
 *     PORT_P25_PullDown_Set();
 * }
 * ~~~~~~~~~~~~~~~
 * \ingroup PORT_api
 */
INLINE void PORT_P25_PullDown_Set(void)
{
  Field_Mod8(&PORT->P2_PUDSEL.reg, (uint8)PORT_P2_PUDSEL_P5_Pos, (uint8)PORT_P2_PUDSEL_P5_Msk, 0u);
}


/*******************************************************************************
**                        Global Function Declarations                        **
*******************************************************************************/
/** \brief Initializes the PORT module based on the Config Wizard for MOTIX MCU configuration
 * \note This function violates [MISRA Rule 38]
 *
 * \ingroup PORT_api
 */
void PORT_Init(void);

/** \brief Sets/clears/toggles a port pin in a safe way, i.e. with interrupt disable.
 * \note This function violates [MISRA Rule 45]
 *
 * \param PortPin Port and pin to change, e.g 0x12U for P1.2
 * \param Action PORT_ACTION_SET, PORT_ACTION_CLEAR or PORT_ACTION_TOGGLE
 *
 * \brief <b>Example</b><br>
 * \brief This example toggles the P1.2 .
 * ~~~~~~~~~~~~~~~{.c}
 * void Example_Function(void)
 * {
 *     PORT_ChangePin(0x12, PORT_ACTION_TOGGLE);
 * }
 * ~~~~~~~~~~~~~~~
 * \ingroup PORT_api
 */
void PORT_ChangePin(uint32 PortPin, uint32 Action);

/** \brief Reads a port pin.
 * \note This function violates [MISRA Rule 45]
 *
 * \param PortPin Port and pin to read, e.g 0x12U for P1.2
 * \return Port pin level (0U or 1U)
 *
 * \brief <b>Example</b><br>
 * \brief This example reads the status of P1.2 .
 * ~~~~~~~~~~~~~~~{.c}
 * void Example_Function(void)
 * {
 *     uint8 sts;
 *
 *     sts = PORT_ReadPin(0x12);
 * }
 * ~~~~~~~~~~~~~~~
 * \ingroup PORT_api
 */
uint8 PORT_ReadPin(uint32 PortPin);

/** \brief Reads a port.
 * \note This function violates [MISRA Rule 45]
 *
 * \param Port Port to read, e.g. 2U for Port 2
 * \return Port data (combination of 0Us and 1Us)
 *
 * \brief <b>Example</b><br>
 * \brief This example reads the status of Port2 .
 * ~~~~~~~~~~~~~~~{.c}
 * void Example_Function(void)
 * {
 *     uint8 sts;
 *
 *     sts = PORT_ReadPort(0x2);
 * }
 * ~~~~~~~~~~~~~~~
 * \ingroup PORT_api
 */
uint8 PORT_ReadPort(uint32 Port);


/** \brief Change Alternate Settings.
 * \note This function violates [MISRA Rule 45]
 *
 * \param PortPin pin to change AltSel, e.g. 0x01U for Port 0 Pin 1
 * \param AltSel alternate function for the pin (combination of 0Us and 1Us)
 *
 * \brief <b>Example</b><br>
 * \brief This example sets the P1.2 to Output and configures it to Normal GPIO.
 * ~~~~~~~~~~~~~~~{.c}
 * void Example_Function(void)
 * {
 *     PORT_P12_Output_Set();
 *     PORT_ChangePinAlt(0x12, 0u);
 * }
 * ~~~~~~~~~~~~~~~
 * \ingroup PORT_api
 */
void PORT_ChangePinAlt(uint32 PortPin, uint8 AltSel);


#endif /* PORT_H */
